espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/bluetooth/common/btmesh_sensor_server/sl_btmesh_sensor_server.c
/***************************************************************************//**
 * @file
 * @brief BT Mesh Sensor Server Instances
 *******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

// C Standard Library headers
#include <stdio.h>
#include <math.h>
#include "sl_status.h"
// Bluetooth stack headers
#include "sl_bt_api.h"
#include "sl_btmesh_api.h"
#include "sl_btmesh_sensor.h"
#include "sl_btmesh_dcd.h"
#include "sl_simple_timer.h"

#include "app_assert.h"
#include "em_common.h"

#include "sl_board_control_config.h"

#ifdef SL_COMPONENT_CATALOG_PRESENT
#include "sl_component_catalog.h"
#endif // SL_COMPONENT_CATALOG_PRESENT

#ifdef SL_CATALOG_APP_LOG_PRESENT
#include "app_log.h"
#endif // SL_CATALOG_APP_LOG_PRESENT

#ifdef SL_CATALOG_SENSOR_RHT_PRESENT
#include "sl_sensor_rht_config.h"
#include "sl_sensor_rht.h"
#endif // SL_CATALOG_SENSOR_RHT_PRESENT

#ifdef SL_CATALOG_BTMESH_SENSOR_PEOPLE_COUNT_PRESENT
#include "sl_btmesh_sensor_people_count_config.h"
#include "sl_btmesh_sensor_people_count.h"
#endif // SL_CATALOG_BTMESH_SENSOR_PEOPLE_COUNT_PRESENT

#ifdef SL_CATALOG_SENSOR_LIGHT_PRESENT
#include "sl_sensor_light_config.h"
#include "sl_sensor_light.h"
#elif defined(SL_CATALOG_SENSOR_LUX_PRESENT)
#include "sl_sensor_lux_config.h"
#include "sl_sensor_lux.h"
#endif

#include "sl_btmesh_sensor_server.h"
#include "sl_btmesh_sensor_server_config.h"
#include "sl_btmesh_sensor_server_cadence.h"

// Warning! The app_btmesh_util shall be included after the component configuration
// header file in order to provide the component specific logging macro.
#include "app_btmesh_util.h"

/***************************************************************************//**
 * @addtogroup Sensor
 * @{
 ******************************************************************************/

#define SENSOR_SERVER_SEND_FAILED_TEXT "Sensor server send %s failed\r\n"
#define SENSOR_SETUP_SERVER_SEND_FAILED_TEXT "Sensor setup server send %s failed\r\n"

/// The unused 0 address is used for publishing
#define PUBLISH_TO_ALL_NODES    0
/// Parameter ignored for publishing
#define IGNORED                 0
/// No flags used for message
#define NO_FLAGS                0
/// Pre-scale value for temperature sensor raw data
#define TEMPERATURE_PRE_SCALE   2
/// Offset value for temperature sensor pre-scaled value
#define TEMPERATURE_OFFSET      499
/// Scale value for temperature sensor final value
#define TEMPERATURE_SCALE_VAL   1000
/// Length of sensor data buffer
#define SENSOR_DATA_BUF_LEN     15
/// Property ID indicating reading every sensor
#define PROPERTY_ID_ALL         0
/// Buffer length for get cadence parameters
#define SENSOR_CADENCE_BUF_LEN  10
/// Acknowledgement request mask
#define SET_CADENCE_ACK_FLAG    2
/// Callback has no parameters
#define NO_CALLBACK_DATA        (void *)NULL
/// Multiplier for seconds conversion to millisenconds
#define SEC_TO_MS               1000
/// Sensor Update Interval formula power extractor constant
#define EXTRACTOR_CONSTANT      64

#define MIN(a, b)               (((a) < (b)) ? (a) : (b))

#ifdef SL_CATALOG_SENSOR_RHT_PRESENT
temperature_8_t get_temperature(void);
bool            rht_initialized;
#endif // SL_CATALOG_SENSOR_RHT_PRESENT

#if defined(SL_CATALOG_SENSOR_LIGHT_PRESENT) \
  || defined(SL_CATALOG_SENSOR_LUX_PRESENT)
illuminance_t get_light(void);
#endif //SL_CATALOG_SENSOR_LIGHT_PRESENT || SL_CATALOG_SENSOR_LUX_PRESENT

#if SENSOR_THERMOMETER_CADENCE || SENSOR_PEOPLE_COUNT_CADENCE
static uint32_t prev_publish_timeout;
static sl_btmesh_evt_sensor_server_publish_t publish_period;

// -------------------------------
// Periodic timer handles
static sl_simple_timer_t sensor_server_data_timer;
static sl_simple_timer_t sensor_server_publish_timer;

// -------------------------------
// Periodic timer callbacks
static void sensor_server_data_timer_cb(sl_simple_timer_t *handle, void *data);
static void sensor_server_publish_timer_cb(sl_simple_timer_t *handle, void *data);
#endif

void sl_btmesh_sensor_server_node_init(void)
{
  /// Descriptors of supported sensors
  /* The following properties are defined
   * 1. People count property (property ID: 0x004C)
   * 2. Present ambient light property (property ID: 0x004E)
   * 3. Present ambient temperature property (property ID: 0x004F)
   * NOTE: the properties must be ordered in ascending order by property ID
   */
  static const sensor_descriptor_t descriptors[] = {
#ifdef SL_CATALOG_BTMESH_SENSOR_PEOPLE_COUNT_PRESENT
    {
      .property_id = PEOPLE_COUNT,
      .positive_tolerance = SL_BTMESH_SENSOR_PEOPLE_COUNT_POSITIVE_TOLERANCE_CFG_VAL,
      .negative_tolerance = SL_BTMESH_SENSOR_PEOPLE_COUNT_NEGATIVE_TOLERANCE_CFG_VAL,
      .sampling_function = SL_BTMESH_SENSOR_PEOPLE_COUNT_SAMPLING_FUNCTION_CFG_VAL,
      .measurement_period = SL_BTMESH_SENSOR_PEOPLE_COUNT_MEASUREMENT_PERIOD_CFG_VAL,
      .update_interval = SL_BTMESH_SENSOR_PEOPLE_COUNT_UPDATE_INTERVAL_CFG_VAL
    },
#endif // SL_CATALOG_BTMESH_SENSOR_PEOPLE_COUNT_PRESENT
#if defined(SL_BOARD_ENABLE_SENSOR_LIGHT) \
    && SL_BOARD_ENABLE_SENSOR_LIGHT
#ifdef SL_CATALOG_SENSOR_LIGHT_PRESENT
    {
      .property_id = PRESENT_AMBIENT_LIGHT_LEVEL,
      .positive_tolerance = SENSOR_LIGHT_POSITIVE_TOLERANCE,
      .negative_tolerance = SENSOR_LIGHT_NEGATIVE_TOLERANCE,
      .sampling_function = SENSOR_LIGHT_SAMPLING_FUNCTION,
      .measurement_period = SENSOR_LIGHT_MEASUREMENT_PERIOD,
      .update_interval = SENSOR_LIGHT_UPDATE_INTERVAL
    },
#elif defined(SL_CATALOG_SENSOR_LUX_PRESENT)
    {
      .property_id = PRESENT_AMBIENT_LIGHT_LEVEL,
      .positive_tolerance = SENSOR_LUX_POSITIVE_TOLERANCE,
      .negative_tolerance = SENSOR_LUX_NEGATIVE_TOLERANCE,
      .sampling_function = SENSOR_LUX_SAMPLING_FUNCTION,
      .measurement_period = SENSOR_LUX_MEASUREMENT_PERIOD,
      .update_interval = SENSOR_LUX_UPDATE_INTERVAL
    },
#endif // SL_CATALOG_SENSOR_LIGHT_PRESENT, SL_CATALOG_SENSOR_LUX_PRESENT
#endif // SL_BOARD_ENABLE_SENSOR_LIGHT
#if defined(SL_CATALOG_SENSOR_RHT_PRESENT) \
    && defined(SL_BOARD_ENABLE_SENSOR_RHT) \
    && SL_BOARD_ENABLE_SENSOR_RHT
    {
      .property_id = PRESENT_AMBIENT_TEMPERATURE,
      .positive_tolerance = SENSOR_THERMOMETER_POSITIVE_TOLERANCE,
      .negative_tolerance = SENSOR_THERMOMETER_NEGATIVE_TOLERANCE,
      .sampling_function = SENSOR_THERMOMETER_SAMPLING_FUNCTION,
      .measurement_period = SENSOR_THERMOMETER_MEASUREMENT_PERIOD,
      .update_interval = SENSOR_THERMOMETER_UPDATE_INTERVAL
    },
#endif // SL_CATALOG_SENSOR_RHT_PRESENT
  };

