espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/bluetooth/common/btmesh_sensor_server/sl_btmesh_sensor_server.c
  uint16_t status = mesh_lib_sensor_server_init(BTMESH_SENSOR_SERVER_MAIN,
                                                sizeof(descriptors)
                                                / sizeof(sensor_descriptor_t),
                                                descriptors);
  app_assert_status_f(status, "Sensor Init Error\n");

#ifdef SL_CATALOG_BTMESH_SENSOR_PEOPLE_COUNT_PRESENT
  sl_btmesh_set_people_count(0);
#endif // SL_CATALOG_BTMESH_SENSOR_PEOPLE_COUNT_PRESENT
#if defined(SL_BOARD_ENABLE_SENSOR_LIGHT) && SL_BOARD_ENABLE_SENSOR_LIGHT
#ifdef SL_CATALOG_SENSOR_LIGHT_PRESENT
  {
    sl_status_t sc;
    sc = sl_sensor_light_init();
    if (sc != SL_STATUS_OK) {
      app_log_warning("Ambient light and UV index sensor initialization failed.");
      app_log_nl();
    }
  }
#endif // SL_CATALOG_SENSOR_LIGHT_PRESENT
#ifdef SL_CATALOG_SENSOR_LUX_PRESENT
  {
    sl_status_t sc;
    sc = sl_sensor_lux_init();
    if (sc != SL_STATUS_OK) {
      app_log_warning("Ambient light sensor initialization failed.");
      app_log_nl();
    }
  }
#endif // SL_CATALOG_SENSOR_LUX_PRESENT
#endif // SL_BOARD_ENABLE_SENSOR_LIGHT
#if defined(SL_CATALOG_SENSOR_RHT_PRESENT) \
  && defined(SL_BOARD_ENABLE_SENSOR_RHT)   \
  && SL_BOARD_ENABLE_SENSOR_RHT
  {
    sl_status_t sc;
    sc = sl_sensor_rht_init();
    if (sc != SL_STATUS_OK) {
      app_log_warning("Relative Humidity and Temperature sensor initialization failed.");
      app_log_nl();
#if SENSOR_THERMOMETER_CADENCE
      rht_initialized = false;
    } else {
      rht_initialized = true;
    }
#else
    }
#endif // SENSOR_THERMOMETER_CADENCE
  }
#endif // SL_CATALOG_SENSOR_RHT_PRESENT

#if SENSOR_PEOPLE_COUNT_CADENCE && SENSOR_THERMOMETER_CADENCE
  uint32_t update_interval;
  sl_btmesh_sensor_people_count_cadence_init(0);
  if (rht_initialized == true) {
    sl_btmesh_sensor_thermometer_cadence_init(get_temperature());
    update_interval = MIN(SENSOR_THERMOMETER_UPDATE_INTERVAL, SL_BTMESH_SENSOR_PEOPLE_COUNT_UPDATE_INTERVAL_CFG_VAL);
  } else {
    update_interval = SL_BTMESH_SENSOR_PEOPLE_COUNT_UPDATE_INTERVAL_CFG_VAL;
  }
#elif SENSOR_PEOPLE_COUNT_CADENCE
  uint32_t update_interval;
  sl_btmesh_sensor_people_count_cadence_init(0);
  update_interval = SL_BTMESH_SENSOR_PEOPLE_COUNT_UPDATE_INTERVAL_CFG_VAL;
#elif SENSOR_THERMOMETER_CADENCE
  uint32_t update_interval;
  if (rht_initialized == true) {
    sl_btmesh_sensor_thermometer_cadence_init(get_temperature());
    update_interval = SENSOR_THERMOMETER_UPDATE_INTERVAL;
  } else {
    update_interval = 0;
  }
#endif

#if SENSOR_PEOPLE_COUNT_CADENCE || SENSOR_THERMOMETER_CADENCE
  if (update_interval != 0) {
    sl_status_t sc = sl_simple_timer_start(&sensor_server_data_timer,
                                           ((uint32_t)(pow((double)1.1, ((double)update_interval - 64)) * 1000)),
                                           sensor_server_data_timer_cb,
                                           NO_CALLBACK_DATA,
                                           true);
    app_assert_status_f(sc, "Failed to start periodic sensor_server_data_timer\r\n");
  }
#endif
}

/***************************************************************************//**
 * Handling of sensor server get request event.
 * It sending sensor status message with data for all of supported Properties ID,
 * if there is no Property ID field in request. If request contains Property ID
 * that is supported, functions reply with the sensor status message with data
 * for this Property ID, in other case the message contains no data.
 *
 * @param[in] evt  Pointer to sensor server get request event.
 ******************************************************************************/
static void handle_sensor_server_get_request(
  sl_btmesh_evt_sensor_server_get_request_t *evt)
{
  // A slot for all sensor data
  uint8_t sensor_data[SENSOR_DATA_BUF_LEN];
  uint8_t len = 0;
  sl_status_t sc;

  (void)evt;
#ifdef SL_CATALOG_BTMESH_SENSOR_PEOPLE_COUNT_PRESENT
  if ((evt->property_id == PEOPLE_COUNT)
      || (evt->property_id == PROPERTY_ID_ALL)) {
    count16_t people_count = sl_btmesh_get_people_count();
    sl_btmesh_sensor_server_on_people_count_measurement(people_count);
    len += mesh_sensor_data_to_buf(PEOPLE_COUNT,
                                   &sensor_data[len],
                                   (uint8_t*)&people_count);
  }
#endif // SL_CATALOG_BTMESH_SENSOR_PEOPLE_COUNT_PRESENT
#if defined(SL_BOARD_ENABLE_SENSOR_LIGHT) \
  && SL_BOARD_ENABLE_SENSOR_LIGHT
#if defined(SL_CATALOG_SENSOR_LIGHT_PRESENT) \
  || defined(SL_CATALOG_SENSOR_LUX_PRESENT)
  if ((evt->property_id == PRESENT_AMBIENT_LIGHT_LEVEL)
      || (evt->property_id == PROPERTY_ID_ALL)) {
    illuminance_t light = get_light();
    len += mesh_sensor_data_to_buf(PRESENT_AMBIENT_LIGHT_LEVEL,
                                   &sensor_data[len],
                                   (uint8_t*)&light);
  }
#endif // SL_CATALOG_SENSOR_LIGHT_PRESENT || SL_CATALOG_SENSOR_LUX_PRESENT
#endif // SL_BOARD_ENABLE_SENSOR_LIGHT
#if defined(SL_CATALOG_SENSOR_RHT_PRESENT) \
  && defined(SL_BOARD_ENABLE_SENSOR_RHT)   \
  && SL_BOARD_ENABLE_SENSOR_RHT
  if ((evt->property_id == PRESENT_AMBIENT_TEMPERATURE)
      || (evt->property_id == PROPERTY_ID_ALL)) {
    temperature_8_t temperature = get_temperature();
    len += mesh_sensor_data_to_buf(PRESENT_AMBIENT_TEMPERATURE,
                                   &sensor_data[len],
                                   (uint8_t*)&temperature);
  }
#endif // SL_CATALOG_SENSOR_RHT_PRESENT
  if (len > 0) {
    sc = sl_btmesh_sensor_server_send_status(evt->client_address,
                                             BTMESH_SENSOR_SERVER_MAIN,
                                             evt->appkey_index,
                                             NO_FLAGS,
                                             len,
                                             sensor_data);
  } else {
    sensor_data[0] = evt->property_id & 0xFF;
    sensor_data[1] = ((evt->property_id) >> 8) & 0xFF;
    sensor_data[2] = 0; // Length is 0 for unsupported property_id
    sc = sl_btmesh_sensor_server_send_status(evt->client_address,
                                             BTMESH_SENSOR_SERVER_MAIN,
                                             evt->appkey_index,
                                             NO_FLAGS,
                                             3,
                                             sensor_data);
  }
  log_status_error_f(sc,
                     SENSOR_SERVER_SEND_FAILED_TEXT,
                     "status");
}

/***************************************************************************//**
 * Handling of sensor server get column request event.
 * Used Property IDs does not have sensor series column state,
 * so reply has the same data as request according to specification.
 *
 * @param[in] evt  Pointer to sensor server get column request event.
 ******************************************************************************/
static void handle_sensor_server_get_column_request(
  sl_btmesh_evt_sensor_server_get_column_request_t *evt)
{
  sl_status_t sc;
  sc = sl_btmesh_sensor_server_send_column_status(evt->client_address,
                                                  BTMESH_SENSOR_SERVER_MAIN,
                                                  evt->appkey_index,
                                                  NO_FLAGS,
                                                  evt->property_id,
                                                  evt->column_ids.len,
                                                  evt->column_ids.data);

