espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/bluetooth/common/btmesh_sensor_server/sl_btmesh_sensor_server.c
  log_status_error_f(sc,
                     SENSOR_SERVER_SEND_FAILED_TEXT,
                     "column status");
}

/***************************************************************************//**
 * Handling of sensor server get series request event.
 * Used Property IDs does not have sensor series column state,
 * so reply has only Property ID according to specification.
 *
 * @param[in] evt  Pointer to sensor server get series request event.
 ******************************************************************************/
static void handle_sensor_server_get_series_request(
  sl_btmesh_evt_sensor_server_get_series_request_t *evt)
{
  sl_status_t sc;
  sc = sl_btmesh_sensor_server_send_series_status(evt->client_address,
                                                  BTMESH_SENSOR_SERVER_MAIN,
                                                  evt->appkey_index,
                                                  NO_FLAGS,
                                                  evt->property_id,
                                                  0,
                                                  NULL);

  log_status_error_f(sc,
                     SENSOR_SERVER_SEND_FAILED_TEXT,
                     "series status");
}

/***************************************************************************//**
 * It is used for sensor states publishing
 *
 * @return  none
 ******************************************************************************/
static void sensor_server_publish(void)
{
  uint8_t sensor_data[SENSOR_DATA_BUF_LEN];
  uint8_t len = 0;

#ifdef SL_CATALOG_BTMESH_SENSOR_PEOPLE_COUNT_PRESENT
  count16_t people_count = sl_btmesh_get_people_count();
  sl_btmesh_sensor_server_on_people_count_measurement(people_count);
  len += mesh_sensor_data_to_buf(PEOPLE_COUNT,
                                 &sensor_data[len],
                                 (uint8_t*)&people_count);
#endif // SL_CATALOG_BTMESH_SENSOR_PEOPLE_COUNT_PRESENT

#if defined(SL_BOARD_ENABLE_SENSOR_LIGHT) && SL_BOARD_ENABLE_SENSOR_LIGHT
#if defined(SL_CATALOG_SENSOR_LIGHT_PRESENT) \
  || defined(SL_CATALOG_SENSOR_LUX_PRESENT)
  illuminance_t light = get_light();
  len += mesh_sensor_data_to_buf(PRESENT_AMBIENT_LIGHT_LEVEL,
                                 &sensor_data[len],
                                 (uint8_t*)&light);
#endif // SL_CATALOG_SENSOR_LIGHT_PRESENT || SL_CATALOG_SENSOR_LUX_PRESENT
#endif // SL_BOARD_ENABLE_SENSOR_LIGHT

#if defined(SL_BOARD_ENABLE_SENSOR_RHT) && SL_BOARD_ENABLE_SENSOR_RHT
#ifdef SL_CATALOG_SENSOR_RHT_PRESENT
  temperature_8_t temperature = get_temperature();
  len += mesh_sensor_data_to_buf(PRESENT_AMBIENT_TEMPERATURE,
                                 &sensor_data[len],
                                 (uint8_t*) &temperature);
#endif // SL_CATALOG_SENSOR_RHT_PRESENT
#endif // SL_BOARD_ENABLE_SENSOR_RHT

  if (len > 0) {
    sl_status_t sc = sl_btmesh_sensor_server_send_status(PUBLISH_TO_ALL_NODES,
                                                         BTMESH_SENSOR_SERVER_MAIN,
                                                         IGNORED,
                                                         NO_FLAGS,
                                                         len,
                                                         sensor_data);
    log_btmesh_status_f(sc, SENSOR_SERVER_SEND_FAILED_TEXT, "status");
  }
}

/***************************************************************************//**
 * Handling of sensor server publish event.
 * Indicates that the publishing period timer elapsed and updates the current
 * publishing period that can be used to estimate the next tick, e.g., when
 * the state should be reported at higher frequency.
 *
 * @param[in] evt  Pointer to sensor server publish request event structure
 ******************************************************************************/
static void handle_sensor_server_publish_event(
  sl_btmesh_evt_sensor_server_publish_t *evt)
{
#if SENSOR_THERMOMETER_CADENCE || SENSOR_PEOPLE_COUNT_CADENCE
  publish_period = *evt;

#else
  (void)evt;
  sensor_server_publish();
#endif
}

/***************************************************************************//**
 * Handling of sensor setup server get cadence request event.
 *
 * @param[in] evt  Pointer to sensor server get cadence request event.
 ******************************************************************************/
static void handle_sensor_setup_server_get_cadence_request(
  sl_btmesh_evt_sensor_setup_server_get_cadence_request_t *evt)
{
  sl_status_t sc;
  uint16_t buff_len = 0;
  uint8_t* buff_addr = NULL;

#if SENSOR_THERMOMETER_CADENCE || SENSOR_PEOPLE_COUNT_CADENCE
  uint8_t cadence_status_buf[SENSOR_CADENCE_BUF_LEN];
#endif

#if SENSOR_THERMOMETER_CADENCE
  if (evt->property_id == PRESENT_AMBIENT_TEMPERATURE) {
    buff_len = sl_btmesh_sensor_thermometer_get_cadence(SENSOR_CADENCE_BUF_LEN, cadence_status_buf);
    buff_addr = cadence_status_buf;
  }
#endif // SENSOR_THERMOMETER_CADENCE

#if SENSOR_PEOPLE_COUNT_CADENCE
  if (evt->property_id == PEOPLE_COUNT) {
    buff_len = sl_btmesh_sensor_people_count_get_cadence(SENSOR_CADENCE_BUF_LEN, cadence_status_buf);
    buff_addr = cadence_status_buf;
  }
#endif // SENSOR_THERMOMETER_CADENCE

  sc = sl_btmesh_sensor_setup_server_send_cadence_status(evt->client_address,
                                                         BTMESH_SENSOR_SERVER_MAIN,
                                                         evt->appkey_index,
                                                         NO_FLAGS,
                                                         evt->property_id,
                                                         buff_len,
                                                         buff_addr);
  log_status_error_f(sc,
                     SENSOR_SETUP_SERVER_SEND_FAILED_TEXT,
                     "cadence status");
}

/***************************************************************************//**
 * Handling of sensor setup server set cadence request event.
 *
 * @param[in] evt  Pointer to sensor server set cadence request event.
 ******************************************************************************/
static void handle_sensor_setup_server_set_cadence_request(
  sl_btmesh_evt_sensor_setup_server_set_cadence_request_t *evt)
{
  bool param_validity = true;
  uint16_t buff_len = 0;
  uint8_t* buff_addr = NULL;

#if SENSOR_THERMOMETER_CADENCE || SENSOR_PEOPLE_COUNT_CADENCE
  uint8_t cadence_status_buf[SENSOR_CADENCE_BUF_LEN];
#endif

#if SENSOR_THERMOMETER_CADENCE
  if (evt->property_id == PRESENT_AMBIENT_TEMPERATURE) {
    // store incoming cadence parameters
    param_validity = sl_btmesh_sensor_thermometer_set_cadence(evt);
    if (((evt->flags & SET_CADENCE_ACK_FLAG) == SET_CADENCE_ACK_FLAG)
        && (param_validity == true)) {
      // prepare buffer for cadence status response
      buff_len = sl_btmesh_sensor_thermometer_get_cadence(SENSOR_CADENCE_BUF_LEN, cadence_status_buf);
      buff_addr = cadence_status_buf;
    }
  }
#endif // SENSOR_THERMOMETER_CADENCE

#if SENSOR_PEOPLE_COUNT_CADENCE
  if (evt->property_id == PEOPLE_COUNT) {
    // store incoming cadence parameters
    param_validity = sl_btmesh_sensor_people_count_set_cadence(evt);
    if (((evt->flags & SET_CADENCE_ACK_FLAG) == SET_CADENCE_ACK_FLAG)
        && (param_validity == true)) {
      // prepare buffer for cadence status response
      buff_len = sl_btmesh_sensor_people_count_get_cadence(SENSOR_CADENCE_BUF_LEN, cadence_status_buf);
      buff_addr = cadence_status_buf;
    }
  }
#endif // SENSOR_PEOPLE_COUNT_CADENCE
  if (((evt->flags & SET_CADENCE_ACK_FLAG) == SET_CADENCE_ACK_FLAG)
      && (param_validity == true)) {
    sl_status_t sc = sl_btmesh_sensor_setup_server_send_cadence_status(evt->client_address,
                                                                       BTMESH_SENSOR_SERVER_MAIN,
                                                                       evt->appkey_index,
                                                                       NO_FLAGS,
                                                                       evt->property_id,
                                                                       buff_len,
                                                                       buff_addr);
    log_status_error_f(sc,
                       SENSOR_SETUP_SERVER_SEND_FAILED_TEXT,
                       "cadence status");
  }
}

/***************************************************************************//**
 * Handling of sensor setup server get settings request event.
 * Settings are not supported now, so reply has only Property ID
 * according to specification.
 *
 * @param[in] evt  Pointer to sensor server get settings request event.
 ******************************************************************************/
static void handle_sensor_setup_server_get_settings_request(
  sl_btmesh_evt_sensor_setup_server_get_settings_request_t *evt)
{
  sl_status_t sc;
  sc = sl_btmesh_sensor_setup_server_send_settings_status(evt->client_address,
                                                          BTMESH_SENSOR_SERVER_MAIN,
                                                          evt->appkey_index,
                                                          NO_FLAGS,
                                                          evt->property_id,
                                                          0,
                                                          NULL);
  log_status_error_f(sc,
                     SENSOR_SETUP_SERVER_SEND_FAILED_TEXT,
                     "settings status");
}

/***************************************************************************//**
 * Handling of sensor setup server get setting request event.
 * Settings are not supported now, so reply has only Property ID
 * and Sensor Property ID according to specification.
 *
 * @param[in] evt  Pointer to sensor server get setting request event.
 ******************************************************************************/
static void handle_sensor_setup_server_get_setting_request(
  sl_btmesh_evt_sensor_setup_server_get_setting_request_t *evt)
{
  sl_status_t sc;
  sc = sl_btmesh_sensor_setup_server_send_setting_status(evt->client_address,
                                                         BTMESH_SENSOR_SERVER_MAIN,
                                                         evt->appkey_index,
                                                         NO_FLAGS,
                                                         evt->property_id,
                                                         evt->setting_id,
                                                         0,
                                                         NULL);
  log_status_error_f(sc,
                     SENSOR_SETUP_SERVER_SEND_FAILED_TEXT,
                     "setting status");
}

/***************************************************************************//**
 * Handling of sensor setup server set setting request event.
 * Settings are not supported now, so reply has only Property ID
 * and Sensor Property ID according to specification.
 *
 * @param[in] evt  Pointer to sensor server set setting request event.
 ******************************************************************************/
static void handle_sensor_setup_server_set_setting_request(
  sl_btmesh_evt_sensor_setup_server_set_setting_request_t *evt)
{
  sl_status_t sc;
  sc = sl_btmesh_sensor_setup_server_send_setting_status(evt->client_address,
                                                         BTMESH_SENSOR_SERVER_MAIN,
                                                         evt->appkey_index,
                                                         NO_FLAGS,
                                                         evt->property_id,
                                                         evt->setting_id,
                                                         0,
                                                         NULL);
  log_status_error_f(sc,
                     SENSOR_SETUP_SERVER_SEND_FAILED_TEXT,
                     "setting status");
}

/***************************************************************************//**
 *  Handling of mesh events by sensor server component.
 *  It handles:
 *   - node_initialized
 *   - node_provisioned
 *   - sensor_server_get_request
 *   - sensor_server_get_column_request
 *   - sensor_server_get_series_request
 *   - sensor_setup_server_get_cadence_request
 *   - sensor_setup_server_set_cadence_request
 *   - sensor_setup_server_get_settings_request
 *   - sensor_setup_server_get_setting_request
 *   - sensor_setup_server_set_setting_request
 *
 *  @param[in] evt  Pointer to incoming sensor server event.
 ******************************************************************************/
void sl_btmesh_handle_sensor_server_events(sl_btmesh_msg_t* evt)
{
  switch (SL_BT_MSG_ID(evt->header)) {
    case sl_btmesh_evt_node_initialized_id:
      if (evt->data.evt_node_initialized.provisioned) {
        sl_btmesh_sensor_server_node_init();
      }
      break;

