espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/bluetooth/common/btmesh_sensor_server/sl_btmesh_sensor_server.c
    case sl_btmesh_evt_node_provisioned_id:
      sl_btmesh_sensor_server_node_init();
      break;

    case sl_btmesh_evt_sensor_server_get_request_id:
      handle_sensor_server_get_request(
        &(evt->data.evt_sensor_server_get_request));
      break;

    case sl_btmesh_evt_sensor_server_get_column_request_id:
      handle_sensor_server_get_column_request(
        &(evt->data.evt_sensor_server_get_column_request));
      break;

    case sl_btmesh_evt_sensor_server_get_series_request_id:
      handle_sensor_server_get_series_request(
        &(evt->data.evt_sensor_server_get_series_request));
      break;

    case sl_btmesh_evt_sensor_server_publish_id:
      handle_sensor_server_publish_event(
        &(evt->data.evt_sensor_server_publish));
      break;

    case sl_btmesh_evt_sensor_setup_server_get_cadence_request_id:
      handle_sensor_setup_server_get_cadence_request(
        &(evt->data.evt_sensor_setup_server_get_cadence_request));
      break;

    case sl_btmesh_evt_sensor_setup_server_set_cadence_request_id:
      handle_sensor_setup_server_set_cadence_request(
        &(evt->data.evt_sensor_setup_server_set_cadence_request));
      break;

    case sl_btmesh_evt_sensor_setup_server_get_settings_request_id:
      handle_sensor_setup_server_get_settings_request(
        &(evt->data.evt_sensor_setup_server_get_settings_request));
      break;

    case sl_btmesh_evt_sensor_setup_server_get_setting_request_id:
      handle_sensor_setup_server_get_setting_request(
        &(evt->data.evt_sensor_setup_server_get_setting_request));
      break;

    case sl_btmesh_evt_sensor_setup_server_set_setting_request_id:
      handle_sensor_setup_server_set_setting_request(
        &(evt->data.evt_sensor_setup_server_set_setting_request));
      break;

    default:
      break;
  }
}

#ifdef SL_CATALOG_SENSOR_RHT_PRESENT
/***************************************************************************//**
 * Get the current temperature value measured by sensor.
 *
 * @return Current value of temperature.
 ******************************************************************************/
temperature_8_t get_temperature(void)
{
  int32_t temp_data = 0;
  uint32_t temp_rh = 0;
  temperature_8_t temperature = SL_BTMESH_SENSOR_TEMPERATURE_VALUE_UNKNOWN;
  sl_status_t sc = sl_sensor_rht_get(&temp_rh, &temp_data);
  if (sc == SL_STATUS_OK) {
    temp_data = (((temp_data
                   * TEMPERATURE_PRE_SCALE)
                  + TEMPERATURE_OFFSET)
                 / TEMPERATURE_SCALE_VAL);
    temperature = (temperature_8_t)temp_data;
  } else if (sc != SL_STATUS_NOT_INITIALIZED) {
    log("Warning! Invalid temperature reading: %u %d\n",
        temp_rh,
        temp_data);
  }
  sl_btmesh_sensor_server_on_temperature_measurement(temperature);
  return temperature;
}
#endif // SL_CATALOG_SENSOR_RHT_PRESENT

#if defined(SL_CATALOG_SENSOR_LIGHT_PRESENT) \
  || defined(SL_CATALOG_SENSOR_LUX_PRESENT)
/***************************************************************************//**
 * Get the current light value measured by sensor.
 *
 * @return Current value of light reading.
 ******************************************************************************/
illuminance_t get_light(void)
{
  float lux;
  illuminance_t light = SL_BTMESH_SENSOR_LIGHT_VALUE_UNKNOWN;
  sl_status_t sc;
#ifdef SL_CATALOG_SENSOR_LIGHT_PRESENT
  float uvi;

  sc = sl_sensor_light_get(&lux, &uvi);
#elif defined(SL_CATALOG_SENSOR_LUX_PRESENT)
  sc = sl_sensor_lux_get(&lux);
#endif // SL_CATALOG_SENSOR_LIGHT_PRESENT
  if (sc == SL_STATUS_OK) {
    light = (illuminance_t)lux;
  } else if (sc != SL_STATUS_NOT_INITIALIZED) {
    log("Warning! Invalid light reading: %6ulx\n", (illuminance_t)lux);
  }
  sl_btmesh_sensor_server_on_light_measurement(light);
  return light;
}
#endif // SL_CATALOG_SENSOR_LIGHT_PRESENT || SL_CATALOG_SENSOR_LUX_PRESENT

/***************************************************************************//**
 * Timer Callbacks
 ******************************************************************************/
#if SENSOR_THERMOMETER_CADENCE || SENSOR_PEOPLE_COUNT_CADENCE
/***************************************************************************//**
 * Get measured value from sensors and analyze cadence conditions timer callback
 *
 * @param[in] handle  Pointer to the timer handle
 * @param[in] data    Pointer to callback data
 *
 * @return none
 ******************************************************************************/
static void sensor_server_data_timer_cb(sl_simple_timer_t *handle, void *data)
{
  (void)data;
  (void)handle;
  uint32_t publ_timer_thermometer = publish_period.period_ms;
  uint32_t publ_timer_people_count = publish_period.period_ms;
  uint32_t publ_timeout;
  sl_status_t sc;

#if SENSOR_THERMOMETER_CADENCE
  if (rht_initialized == true) {
    publ_timer_thermometer = sl_btmesh_sensor_thermometer_handle_cadence(get_temperature(), publish_period);
  }
#endif // SENSOR_THERMOMETER_CADENCE

#if SENSOR_PEOPLE_COUNT_CADENCE
  publ_timer_people_count = sl_btmesh_sensor_people_count_handle_cadence(sl_btmesh_get_people_count(), publish_period);
#endif // SENSOR_PEOPLE_COUNT_CADENCE

  if (publ_timer_thermometer > publ_timer_people_count) {
    publ_timeout = publ_timer_people_count;
  } else {
    publ_timeout = publ_timer_thermometer;
  }

  if (prev_publish_timeout != publ_timeout) {
    log_info("Publishing period: %d ms\r\n", publ_timeout);
    //Stop publish timer
    sc = sl_simple_timer_stop(&sensor_server_publish_timer);

    app_assert_status_f(sc, "Failed to stop periodic sensor_server_publish_timer\r\n");

    //Restart publishing timer with the new timer value
    sc = sl_simple_timer_start(&sensor_server_publish_timer,
                               publ_timeout,
                               sensor_server_publish_timer_cb,
                               NO_CALLBACK_DATA,
                               true);
    app_assert_status_f(sc, "Failed to start periodic sensor_server_publish_timer\r\n");
  }
  prev_publish_timeout = publ_timeout;
}

/***************************************************************************//**
 * Publish sensor status timer callback
 *
 * @param[in] handle  Pointer to the timer handle
 * @param[in] data    Pointer to callback data
 *
 * @return none
 ******************************************************************************/
static void sensor_server_publish_timer_cb(sl_simple_timer_t *handle, void *data)
{
  (void)data;
  (void)handle;

  sensor_server_publish();
}
#endif
/**************************************************************************//**
 * @addtogroup btmesh_sens_srv_cb_weak Weak implementation of callbacks
 * @{
 *****************************************************************************/
SL_WEAK void sl_btmesh_sensor_server_on_temperature_measurement(temperature_8_t temperature)
{
  (void) temperature;
}

SL_WEAK void sl_btmesh_sensor_server_on_light_measurement(illuminance_t light)
{
  (void) light;
}

SL_WEAK void sl_btmesh_sensor_server_on_people_count_measurement(count16_t people)
{
  (void) people;
}
/** @} (end addtogroup btmesh_sens_srv_cb_weak) */

/** @} (end addtogroup Sensor) */
